tanishqsngl/STM32f103/Final_1.0/src/main.c
void RoboticArm(uint32_t A)
{
	uint16_t sBase = 0;
	uint16_t sBase1 = 0;
	uint32_t roll = 0;
	uint32_t roll1 = 0;
	uint16_t servoD = 0;
	uint16_t servoD1 = 0;
	uint16_t servoD2 = 0;
	uint16_t servoD21 = 0;

	if(A=='s' || A=='S')//s or S Swivel Base
	{
		for(int i=0;i<4;i++)
		{
			emStop();
			sBase = sBase - 48;
			sBase1 = sBase1*10 + sBase;
		}
		//Main code for swivel base
		TIM1 -> CR1 |= TIM_CR1_CEN;
		TIM1 -> CCER |= TIM_CCER_CC3NE;
		TIM1 -> CCER |= TIM_CCER_CC2NE;

		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_2;
		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_1;
		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_0;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_2;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_1;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_0;

		for(int i=0;i<2;i++)
		{
			emStop();
			sBase = USART1-> DR;
			sBase = sBase - 48;
			sBase1 = sBase1*10 + sBase;
		}

		sBase1 = sBase1-12;
		sBase1 = sBase1*1260;

		if(A=='s')//s forward
		{
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = sBase1;

			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='S')//S backward
		{
			TIM1 -> CCR2 = 32768;
			TIM1 -> CCR3 = sBase1;

			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='t' || A=='T')//DC Servo
	{
		for(int i=0;i<2;i++)
		{
			emStop();
			servoD = USART1 -> DR;
			servoD = servoD-48;
			servoD1 = servoD1*10 + servoD;
		}

		servoD1 = servoD1-12;
		//servoD1 = servoD1;

		if(A=='t')//t
		{
			//DC Servo forward A0 A1 A2 C15
			DCServoF(servoD1);

			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}

		else if(A=='T')//T
		{
			//DC Servo backward
			DCServoB(servoD1);

			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='o' || A=='O')//DC Servo
		{
			for(int i=0;i<2;i++)
			{
				emStop();
				servoD2 = USART1 -> DR;
				servoD2 = servoD2-48;
				servoD21 = servoD21*10 + servoD2;
			}

			servoD21 = servoD21-12;
			//servoD1 = servoD1;

			if(A=='o')//t
			{
				//DC Servo forward A0 A1 A2 C15
				DCServoF1(servoD21);

				GPIOC -> BSRR |= GPIO_BSRR_BR13;
				GPIOC -> BSRR |= GPIO_BSRR_BR14;
				GPIOA -> BSRR |= GPIO_BSRR_BR4;
				GPIOA -> BSRR |= GPIO_BSRR_BR5;
				TIM3 -> CCR1 = 0;
				TIM3 -> CCR2 = 0;
				GPIOA -> BSRR |= GPIO_BSRR_BR11;
				GPIOA -> BSRR |= GPIO_BSRR_BR12;
				TIM1 -> CCR2 = 0;
				TIM1 -> CCR3 = 0;
				GPIOA -> BSRR |= GPIO_BSRR_BR8;
				GPIOB -> BSRR |= GPIO_BSRR_BR5;
				GPIOB -> BSRR |= GPIO_BSRR_BR6;
				GPIOB -> BSRR |= GPIO_BSRR_BR7;
				GPIOB -> BSRR |= GPIO_BSRR_BR8;
				GPIOB -> BSRR |= GPIO_BSRR_BR9;
			}

			else if(A=='O')//T
			{
				//DC Servo backward
				DCServoB1(servoD21);

				GPIOC -> BSRR |= GPIO_BSRR_BR13;
				GPIOC -> BSRR |= GPIO_BSRR_BR14;
				GPIOA -> BSRR |= GPIO_BSRR_BR4;
				GPIOA -> BSRR |= GPIO_BSRR_BR5;
				TIM3 -> CCR1 = 0;
				TIM3 -> CCR2 = 0;
				GPIOA -> BSRR |= GPIO_BSRR_BR11;
				GPIOA -> BSRR |= GPIO_BSRR_BR12;
				TIM1 -> CCR2 = 0;
				TIM1 -> CCR3 = 0;
				GPIOA -> BSRR |= GPIO_BSRR_BR8;
				GPIOB -> BSRR |= GPIO_BSRR_BR5;
				GPIOB -> BSRR |= GPIO_BSRR_BR6;
				GPIOB -> BSRR |= GPIO_BSRR_BR7;
				GPIOB -> BSRR |= GPIO_BSRR_BR8;
				GPIOB -> BSRR |= GPIO_BSRR_BR9;
			}
		}

	if(A=='b' || A=='B')//B b actuator
	{
		if(A=='b')//b forward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;

			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='B')//B backward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BS14;

			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

